Revit 2027 API
SpecTypeId.LuminousIntensity Property
 Luminous Intensity, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LuminousIntensity { get; }
Public Shared ReadOnly Property LuminousIntensity As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LuminousIntensity {
	ForgeTypeId^ get ();
}
static member LuminousIntensity : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace